Revit 2024 API
FilledRegionType.BackgroundPatternColor Property
 The background fill pattern color.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public Color BackgroundPatternColor { get; set; }
Visual Basic
Public Property BackgroundPatternColor As Color
	Get
	Set
Visual C++
public:
property Color^ BackgroundPatternColor {
	Color^ get ();
	void set (Color^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
FilledRegionType Class
Autodesk.Revit.DB Namespace